[
    {
        "user_id": "GeneralBakshi",
        "timestamp": "Jun 5, 2025 · 5:53 PM UTC",
        "text": "More details are Coming out about Indias Hugely successful strikes on Pak Air bases.On 9 May night We hit the AD Command and Control(C4I) bunker in the Nur khan base near Rawalpindi. It was HDBT( hardened deeply buried target)that had been built by General Electric co of US. the Brahmos cruise missiles targeted its 45 cm Vent for AC and Vaporised all 100 officers and computers within. To hide its tremendous loss from spy satellites Pak did not evacuate its casualties. it simply Brought in Dozers and levelled the destroyed bunker with its dead inside. India also destroyed the UAV UG command center at Muridke air base which the Pakis also have simply buried with thier Dozers.Thier UAVs simply fell from the skies. At Bolari we destroyed The massive hangar with an AWAC and 4 F- 16s inside. They have not cleared out the hangar of debris. Just covered gaping holes with tarpuline. Latest reports the Americans have taken over Noor Khan base and are Evacuating Some cargo from there in their transport AC. something serious afoot",
        "platform": "twitter",
        "retweet_count": 3605,
        "like_count": 194,
        "reply_count": 1117
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "Jun 5, 2025 · 5:27 PM UTC",
        "text": "Ukraine int services with support from MI-6 and CIA carried out a spectacular attack on 4 Russian air bases and claim to have destroyed 41 Strategic Bombers( Tu-22and Tu- 94 etc)This is 31 % of Russias One leg of Nuclear triad- a very dangerous escalation. It may be a Brilliant Tactical success that leads to a Strategic disaster.Russias Bombers were lined in open Tarmac as part of START treaty which requires US and Russia to Park their bombers in open to avoid surprise attacks.Russia could hit back with Oreshnik Hypersonic missiles not just on Ukranian command &control targets but also beyond Ukraine on UK air bases. That could lead not just to Vertical and horizontal escalation but also ACCIDENTAL escalation. Europe and Zelenski are determined to sabotage peace talks at any costs by angering Putin. Something is seriously wrong with the Europeans. WWI, WWII all started there. They seem determined to gift the world WW III which may well be a nuclear war.",
        "platform": "twitter",
        "retweet_count": 244,
        "like_count": 15,
        "reply_count": 48
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "Jun 1, 2025 · 8:09 PM UTC",
        "text": "In this pod cast i have summarised the 96 exciting hours of The 5th India- Pak round of OP Sindoor and the paradigm shift It has brought about in South Asia . We saw the first BVR war of the 21st century in which Indian military trchnology has truly come of age. Pak Was decisively beaten and the truth is emerging By degrees At least 14 Paki aircrafts have been destoyed on The ground and air. these include 8 units F- 16, two Saab -2000 AEW&c aircraft, Two Mirages, One IL- 76 Refueller an one C-130 besides 4 radarsand One HQ-9 SAM battry. 11 out of Paks 12 air bases put down and 9 terror camps destroyed with almost 200 terrorists killed. Those interested can see the MAXAR high res satellite picsFor empirical evidence. Indias own Iron dome has worked wonderspiped.video/PqyqIgkfXKs?si=oUfT…",
        "platform": "twitter",
        "retweet_count": 178,
        "like_count": 5,
        "reply_count": 77
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "Jun 1, 2025 · 7:56 PM UTC",
        "text": "Have Completed 75 years of my Journey today. I have recorded My Mystical and Military experiences down in my latest book \"Beyond Fear: A Personal Journey to Soma\". Am grateful to my publisher Motilal Banarsidas for taking this volume out in time for my 75th Birhday. This deals with the two parallel paths in my life-one of a combat soldier- the external path of duty and grim battles and the second the equally ardous path of ones inner spiritual Evolution. Ultimately the Final path we have to traverse is up our own spines from The root chakra to the Shasrara chakra in the brain. I experienced its joy and ecstasy as The descent of The mystical Soma. Vedic Soma was prized both by the Aryan warriors and sages because it took away all fear and Pain. It made The sage ecstatic and joyful . My Gratitude To my wife Suneeta who shared this journey with me and to my Children Aditya and Purnima and their Spouses Nikki and Sandy. Above all are my real treasures- My Garndchildren Anahita and Samar who will carry Forward a Torch that goes back To the warrior Sage Parshram from my fathers side and to Guru Dronacharya from my Moms side. I bow in reverence before my parents and my AncestorsToday",
        "platform": "twitter",
        "retweet_count": 848,
        "like_count": 39,
        "reply_count": 389
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 30, 2025 · 8:40 PM UTC",
        "text": "30th May Mantalai dayThe day when Gen Zorawar Singh of Jak rif recahed the sacred mansarovar lake in tibet. he fought a Fierce night battl with the Chinese - tibetan Forces and routed them. 4 Jak Rif captured the famous Mantali Flag here which still hangs in the officers mess of our oldest battalion.",
        "platform": "twitter",
        "retweet_count": 336,
        "like_count": 5,
        "reply_count": 56
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 28, 2025 · 6:03 PM UTC",
        "text": "Why is India underplaying the Scale and Scope of its victory with Pak?After the effect of Paks initial spin doctoring wore off All Foreign Commentators are clearly Acknowldging Indias stellar performance. See my detailed Pod cast on Republic video chnlpiped.video/b6h9AglrkbE?si=pKw_…",
        "platform": "twitter",
        "retweet_count": 87,
        "like_count": 2,
        "reply_count": 70
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 28, 2025 · 5:57 PM UTC",
        "text": "An intersting interview with Garimepiped.video/hzMrfDbkDjw?si=kPME…",
        "platform": "twitter",
        "retweet_count": 18,
        "like_count": 1,
        "reply_count": 14
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 25, 2025 · 6:15 PM UTC",
        "text": "Gen Asim Munir Had already gotten one extension by exteding tenures of all chiefs to 5 yearsin 2022 itself. Now he has wrangled himslf not just an extension but also a promotion . As a Fd Mshl he now never retires. Is he headed the Ayub khan way of Becoming president of pak? Becoming a Fd Mshl for palnning and executing the Pehelgam massacre followed by a 3 days war in which his army hardly played a part is a joke. He got his Air force battered and Created a PR disaster For the Chinese equipment. Will the Paki Army get rid of him with exploding mangoes ? Or will The cabal of corps commanders unite to get rid of him? For the time being he seems to have strengthened his hold. But will he live to rue the day he got his indefinite extension? Like Gen Yahaya Khan will he preside over the furthur break up of Pakistan into 5 splinters?",
        "platform": "twitter",
        "retweet_count": 316,
        "like_count": 21,
        "reply_count": 112
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 25, 2025 · 5:59 PM UTC",
        "text": "India has strangely been down playing the sheer scale of its success against Pak. It is now emerging slowly that success has been phenomenal .We Destoyed 9 terror camps with 140 terrorists killed, hit 11 Paki air bases, destroyed 4 radars and hit nuclear weapons storage sites in Kirana hills. But hold your breath Wg Cdr Kushwaha has complied pak air craft losses from OSINT sources these are :- 8 units F- 16 Block 58( ground & air) i unit Saab2000(AEW&C 2 units Mirage-3/5 1 unit IL- 78 refueller 1 unit C-130 transport 1 unit HQ-9 SAM battery 4 units radars 2 units AD Command posts Total 13aircraft destroyed and some 50 PAF personell killed Total cost of Aircraft , Equipment and infrastructure will be 5.129 billion $!And Gen Asif munir has been promoted To field ( Failed) Marshal",
        "platform": "twitter",
        "retweet_count": 4659,
        "like_count": 268,
        "reply_count": 1975
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 18, 2025 · 5:06 PM UTC",
        "text": "Arnab had a Splendid first meeting of the Nationalist Collective at his studios.This is an idea whose time has come and i support it Enthusiastically My speech on nationalism as i see itpiped.video/y0ZD-pmUXfQ?si=LK1q…",
        "platform": "twitter",
        "retweet_count": 72,
        "like_count": 5,
        "reply_count": 36
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 18, 2025 · 4:59 PM UTC",
        "text": "India should withdraw from the IMF in protest. Abstination was not enough. Pak was given a dole of 2 bn $ by the IMF in the middle of the conflict. The First major grant announced by the Pak Govt has been to Markaz – e Subhanallah. To rebuild the blasted HQ of JEM. This is the world’s biggest Terror University.Osama bin Laden had given some 10 million $ to build this university. The Indian Sukhois Blasted it to rubble with the Brahmos cruise missiles. The IMF has paid for its reconstruction and replacement of most of the destroyed weapons & Equipment of Pakistan. The Starving people of Pak will not get a penny of this largesse . The biggest terror network of this world- the Pak army will grab it all. America or Europe may well be next on The terror list. HIPOCRISY is the worst sin.",
        "platform": "twitter",
        "retweet_count": 804,
        "like_count": 44,
        "reply_count": 269
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 18, 2025 · 4:59 PM UTC",
        "text": "We are happy the IAEA has declared that all Paki nuclear facilities are free of nuclear radiation. Unfortunately the IAEA does not cover Paki military bases and Nuclear weapons storage facilities. Something serious has happened there. Pak army Lies thru its teeth and tries to conceal its losses. In lying I hope they will not let their people suffer from nuclear Radiation. That can lead to cancer and worse. If I was living in Pak in Islamabad or Rawalpindi I would buy a dosimeter and lots of iodine tablets to prevent throat cancer.Also people Living near Chagai hills need to check dosimeters",
        "platform": "twitter",
        "retweet_count": 1067,
        "like_count": 38,
        "reply_count": 297
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 18, 2025 · 4:55 PM UTC",
        "text": "The real cause of our victory is the Cluster of some 12 Indian satellites called NAVIC. It has Given I meter CEP accuracy to our Offensive and defensive systems. Our Integrated AD system is a marvel of AI- far ahead of chat GPT or chat bot etc. it has created the Indian Iron dome . Our Akash missiles, Brahmos missiles have done wonders. Our Upgraded L- 70 AD guns , ZSU-23 and Schilkas have downed over 600 Turkish and Chinese drones. It has been a PR Disaster for the Chinese and Turkish arms industries. Line up For Indian military systems that work so well folks!",
        "platform": "twitter",
        "retweet_count": 1492,
        "like_count": 50,
        "reply_count": 241
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 16, 2025 · 8:26 PM UTC",
        "text": "The IAEA has been very helpul. Fredrick Dahl from IAEA said-\"\"Based on info available with IAEA there was NO radiation Leak or release from any Nuclear facility in Pak\". IAEA covers Paki civilian nuclear reactors NOT military targets in Air bases. Since when did IAEA start covering Paki Air bases and Nuclear war head Storage sites sites?Is the Kirana Nuclear weapons storage under IAEA safe guards? it would be helpful if IAEA would clarify that. Otherwise there is clear danger to the health of Paks unsuspecting citizens who should rightly be allowed to flee the vicinity of air bases in Nur Khan, Sargodah and Jacobabad. To all living near Kirana hills who saw that major flash and bang. Please urgently buy dosimeters and do not trust the lies of Paki govt. To save face they can deny anything!they should have Organised evacuations To safegaurd Paki populations health",
        "platform": "twitter",
        "retweet_count": 419,
        "like_count": 7,
        "reply_count": 88
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 14, 2025 · 7:09 PM UTC",
        "text": "In war /crisis you need a whole of the Govt approach that helps to synergise the CORE competencies of all organs and individuals of the state to achieve a common goal. Core COMPETENCIES are the key .it does not help if any single organ of the state seeks to go it alone and claim/try to handle everything by itself. The Union War book is the institutional memory of the state and lays down what each ministry has to do. It does not help when One ministry Oversteps its domain and tries to do the job of another. Lone wolf/ lone ranger responses militate against Synergy. it leads to stove piped and fragmented responses. Pak is the best example of this overreach by itsArmy.InIndia civilian supremacy is a GIVEN being a Democracy. Civilian control over armed forces is exercised by the MoD (and now also by NSA sectt In PMO). That is why veterans were surprised to see Secretary MeA take on Briefings on sensitive MILITARY operations involving high- intensity air strikes.These need high levels of domain expertise to be credible.The Secretary MeA is a very competent person but military ops are not his core competency. That is why Pak was able to impose its false narrative of victory in air ops in initial days by far slicker briefings and Power points done by Military officers. Things changed dramatically when (as per SOP) the DGMOs commenced briefing on miltary ops.We should not resort to adhocism in a crisis but go by Standard well tried SOPs. Before 1960 Indias MeA was handling the defense of Arunachal pradesh! Let us not return to that ludicurous situation. Military ops must be handeled by professionals and we must stick to core competencies in a crisis for best SYNERGY.",
        "platform": "twitter",
        "retweet_count": 132,
        "like_count": 5,
        "reply_count": 54
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 13, 2025 · 6:17 PM UTC",
        "text": "It was emotional catharsis as I and my family took a trip down memory lane in this free flowing conversation with Kamiya of Curlytales. It revived some deep seated memories from my long years in the battlefields.The recent conflict has made these memories so poignant. My kids recalled their growing up years on the far flung frontiers.Thank you Kamiya.God Bless you beta. You are now a part of this fauji familypiped.video/0RtZoR2uezE?si=3Mzt…",
        "platform": "twitter",
        "retweet_count": 289,
        "like_count": 6,
        "reply_count": 88
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 12, 2025 · 12:55 PM UTC",
        "text": "What is the aim of op Sindoor?To Decisively end Pak Terror. To that end we have hit 9 Paki Terror camps and killed 140 terrorists. Is that sufficient?No. What more?The real Paki terror managers are the Pak Army and ISI. One Paki Lt Gen attended the funeral of top terrorist Muddassar and laid a wreath on behalf of Pak Army Chief. A miliitary guard of honour was given and another wreath on behalf of Marriam Nawaz. Who are we trying to kid? Why this self deception? Instead of shouting this from the roof tops we are busy spreading this non state actor narrative.If we wont face the truth and act who else will do it on our behalf. Let India stand up and defend its citizen. We will have to take the bull by its horns.",
        "platform": "twitter",
        "retweet_count": 585,
        "like_count": 31,
        "reply_count": 196
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 12, 2025 · 12:51 PM UTC",
        "text": "The Indian armed forces have done a stellar job. In 4 days of kinetic combat we have destroyed 9 major Paki terror camps incl the HQ of LeT, JEM and HM at Muridke, Bhawalpur and Sialkot respectively. 140 terrorists have been killed including some 6 high value targets. Pakistan escalated by widening the conflict by an all out drone/missile offensive all along our western front aimed at some 15 Indian military targets including airfields. After initial probing attacks they launched a major assault with Fatah and Abdali missiles and ALCMs. Our integrated Air defense put up a stellar performance by shooting down almost 90%. In retaliation our Air force hit 11 major Paki Air fds including that of Rawalpindi (Chaklala), Sargodah and Skardu and knocked out 4 Paki AD radars. Two more days of such attacks would have crippled the Paki air force! The IAF and our AD grid shot down some 8 JF-17 Chinese jet fighters, one F-16, one J-10 and one Swedish AEW a/c/ Chinese AWAC. This was spectacular. We should have continued these strikes for min another day or two and then gone for a cease fire. Pak went crying to US begging to be saved. Marko Rubio spoke to Gen Munir. His DGMO spoke to our DGMO whining for a cease fire. Why the desperate hurry to accept it? Finally we agreed and within minutes Pak violated the cease fire all along the LC and IB over 2000 km front. This was not some local hot heads and loose canons. This was deliberate and pre-planned. The outrage in India is totally justified and I'm happy Op Sindoor is still on. So far things seem quiet but just one more transgression and India must complete the job with all force and violence at it's command.",
        "platform": "twitter",
        "retweet_count": 759,
        "like_count": 32,
        "reply_count": 206
    },
    {
        "user_id": "GeneralBakshi",
        "timestamp": "May 12, 2025 · 12:49 PM UTC",
        "text": "I'm amazed by a strange tendency in some sections of our bureaucracy and media to play down the stellar achievements of our armed forces in this conflict — perhaps in the mistaken belief that it would provoke Pakistan !! For God sakes do they not know how hard they have been hit? They would like to deny it of course. If we decide to keep it a tightly guarded state secret, it would have a negative impact on national and military morale in a conflict. Of course nations do hide their losses in a conflict but hiding the enemies losses is a new one. I was gratified to see a return to common sense and standard SOPs with the DGMOs and equivalent of three services finally having a press briefing. It was a tonic to national morale. The Union War Book lays down what all arms of the govt have to do in war/conflict situations. It is the remit of the MoD (and now also NSA sectt) which controls our armed Forces and prepares them for war, to oversee ops thru Service chiefs and now CDS. We are a little confused to see MeA in control of day to day military ops briefings. The return to Standard wartime SOPs is a big relief. This is as close to full scale war as we have gotten since 1971. Let's not fool ourselves.",
        "platform": "twitter",
        "retweet_count": 969,
        "like_count": 16,
        "reply_count": 117
    }
]